Revit 2024 API
ParameterTypeId.IfcExportPredefinedtype Property
 "IFC Predefined Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId IfcExportPredefinedtype { get; }
Visual Basic
Public Shared ReadOnly Property IfcExportPredefinedtype As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ IfcExportPredefinedtype {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace